In [ ]:
"""                                 [ASSIGNMENT]
Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
pip install pandas

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.1)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.5)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.4)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [22]:
import pandas as pd

a = [4,8,15,16,23,42]

b = pd.Series(a)

print(b)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [ ]:
"""
Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [4]:
import pandas as pd
a = [1,2,3,4,5,6,7,8,9,10]
b = pd.Series(a)
print(b)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [ ]:
"""
Q3. Create a Pandas DataFrame that contains the following data:
Name         Age         GENDER
 Alice        25         FEMALE
  Bob         30          MALE
Claire        27         FEMALE
Then, print the DataFrame.

In [7]:
D = {" Name" : ["Alice", "Bob", "Claire"],
     " Age"  : [25, 30,27],
     " Gender" : [ "Female", "Male" , "Female"]}
import pandas as pd
df = pd.DataFrame(D)

In [8]:
df

     Name   Age  Gender
0   Alice    25  Female
1     Bob    30    Male
2  Claire    27  Female

In [ ]:
"""
Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.
answer] Pandas is a very popular open-source Python library that offers a diverse set of tools that aid in performing 
analysis more efficiently. The Pandas package is mainly used for data pre-processing purposes such as data cleaning,
manipulation, and transformation.
A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns.
Heterogenous – DataFrame elements can have different data type
Size-mutable – Elements can be dropped or added in an existing DataFrame.

Pandas Series is a one-dimensional labeled array whose object size cannot be changed. You can also see it as the 
primary building block for a DataFrame, making up its rows and columns.

In [1]:
import pandas as pd

a = [1, 7, 2]

myvar = pd.Series(a)

print(myvar)

0    1
1    7
2    2
dtype: int64

In [ ]:
"""
Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?
ANSWER] Dropping columns in the data
        Dropping rows in the data
        Renaming a column in the dataset
        Select columns with specific data types
        Slicing the dataset

In [3]:
D = {" Name" : ["Alice", "Bob", "Claire"],
     " Age"  : [25, 30,27],
     " Gender" : [ "Female", "Male" , "Female"]}
import pandas as pd
df = pd.DataFrame(D)

In [4]:
df

     Name   Age  Gender
0   Alice    25  Female
1     Bob    30    Male
2  Claire    27  Female

In [17]:

df_dropped = df.drop(1)
df_dropped.head()

     Name   Age  Gender
0   Alice    25  Female
2  Claire    27  Female

In [6]:
df["mobile number"] = 23345566, 7654321 , 45680986

In [7]:
df

     Name   Age  Gender  mobile number
0   Alice    25  Female       23345566
1     Bob    30    Male        7654321
2  Claire    27  Female       45680986

In [10]:
df.transpose()

                      0        1         2
 Name             Alice      Bob    Claire
 Age                 25       30        27
 Gender          Female     Male    Female
mobile number  23345566  7654321  45680986

In [ ]:
"""
Q6. Which of the following is mutable in nature Series, DataFrame, Panel?
answer] All Pandas data structures are value mutable (can be changed) and except Series all are size mutable. Series is size
immutable.

In [ ]:
"""
Q7. Create a DataFrame using multiple Series. Explain with an example.

In [11]:
import pandas as pd

In [18]:
age = pd.Series([23,45,65] , name = "age")
name = pd.Series(["ram " , " krishna", "shubham"] , name = " name")
gender = pd.Series(["male","male","male"]  , name = " gender")
df = pd.concat([age,name,gender], axis = 1)
print(df)

   age      name  gender
0   23      ram     male
1   45   krishna    male
2   65   shubham    male

In [20]:

courses = pd.Series(["Spark","PySpark","Hadoop"], name='courses')
fees = pd.Series([22000,25000,23000], name='fees')
discount  = pd.Series([1000,2300,1000],name='discount')

df=pd.concat([courses,fees,discount],axis=1)
print(df)

   courses   fees  discount
0    Spark  22000      1000
1  PySpark  25000      2300
2   Hadoop  23000      1000